'''
백준 - https://www.acmicpc.net/problem/11727

< 2xn 타일링 2 >

2xn 직사각형을 1x2, 2x1, 2x2로 채우는 방법의 수

1 <= n <= 1000
'''
'''
n = 1) (|)
n = 2) (ㅡ,ㅡ), (|,|), (||)
n = 3) (|, ||), (|, ㅡ,ㅡ), (ㅡ,ㅡ,|), (|,|,|), (||, |)
n = 4) (ㅡ,ㅡ,||), (|,|,||), (||, ||)
       = [n = 2]에 (||) 추가
       (ㅡ,ㅡ,ㅡ,ㅡ), (|,|,ㅡ,ㅡ), (||, ㅡ,ㅡ)
       = [n - 2]에 (ㅡ,ㅡ) 추가
       (|,||,|), (||,|,|), (ㅡ,ㅡ,|,|)
       = [n = 3]에 (|) 추가
시간 복잡도는 O(N)
'''
import sys

input = sys.stdin.readline

n = int(input())
dp = [0] * (n + 1)

if n == 1:
    print(1)
elif n == 2:
    print(3)
else:
    dp[1] = 1
    dp[2] = 3
    for i in range(3, n + 1):
        dp[i] = (dp[i - 2] + dp[i - 2] + dp[i - 1]) % 10007
    print(dp[n])
